{
    "title": "Up to 21 EMBER-denominated farms (top 14 TLV + 7 boosts)",
    "content": "1. PROPOSAL DETAILS\n\nThe goal of this proposal is to end with up to 21 EMBER-denominated farms as a combination of 14 TLV-based farms and 7 boosted farms. The 14 farms are based on top 14 tokens (excluding other DEX tokens) as measured by their TLV on https://www.marketcap.cash/. These farms are renewed on monthly basis as we already renew current 15 farms. These top 14 farms are to receive 2/3 of their current allocations, designating 1/3 to the boosted farms.\n\nThe 7 boosted farms are to receive 1/3 of the emission allocations, split evenly among the 7 boosted farms. These boosted farms are:\n\n(A) either manually voted-in farms through seperate proposals,\n\n(B) or automatic boosts for the top X farms as measured by their trading volume on EmberSwap.\n\nX is the number of leftover spots for the boosted farms that have not been voted-in manually. For example, if there are 4 manually voted-in farms, then X=7-4=3 and we consider top 3 farms based on trading volume on EmberSwap to receive the remaining 3 spots. New governance proposals can be made to add or remove manually boosted farms. No double-dipping of boosts - if a farm is manually voted in, it cannot receive a second boost based on the top trading volume.\n\n &nbsp; \n\n2. ECONOMIC IMPACT\n\nThis proposal will:\n\n(1) Remove FIRE:BCH farm and reassign its allocation to already existing EMBER:FIRE pair.\n\n(2) Remove lawUSD:BCH and lawUSD:FLEXUSD farms and reassign their allocations to new EMBER:lawUSD pair.\n\n(3) Change each other non-EMBER pair from token:BCH to EMBER:token, keeping the farm allocation as is.\n\n(4) Since (1) and (2) reduce 15 existing pairs to 13 EMBER-denominated pairs, 14th top token is added, using the allocation system as we have now, ending up with the top 14 tokens based on total TLV from https://www.marketcap.cash/ at the time of the renewal.\n\n(5) Allocations for these top 14 pairs are reduced to 2/3 of what they are.\n\n(6) 7 boosted farms receive an equal share of that 1/3 emission allocations going to farms.\n\n &nbsp; \n\n3. IMPACT ON USERS\n\nWe end up as the first community-governed DEX with only DEX's native token-denominated pairs that respond to objective market indicators (top tokens via TLV on entire market), DEX-specific perfmance indicators (automatic boosts via trading volume on EmberSwap), and community input (manual boosts via governance votes). This unique innovation will differntiate EmberSwap from other C/DEX platforms and attract new users.\n\n &nbsp; \n\n4. EXPECTED POSITIVE IMPACT\n\nHaving only EMEBER-denominated farms and swaps via multihops will increase the demand for EMBER and should counterbalance (if not outperform) inflation pressures from emissions. Furthermore, new farm liquidity providers will have to get EMBER of equal value to create EMBER:token pairs, thus further increasing long-term demand for EMBER.\n\n &nbsp; \n\n5. KNOWN POTENTIAL OR NEGATIVE DOWNSIDES\n\nThe need to get EMBER first before joining a farm creates a relative entry barrier. There might be relatively lower liquidity initially when compared to BCH:token pairs. However, with the EmberSwap community supporters holding or planning to acquiring EMBER in 6-digit dollar values, this downside will be likely temporary, if at all.\n\n &nbsp; \n\n6. UNKNOWN IMPACTS OR ASPECTS\n\nBeing the first DEX of this innovative kind, in the long-run, we could attract a lot of positive attention and new users (farm providers, DEX users swapping tokens with EMBER-denominated multi-hops). Or we could be considered too niche, scaring new users away with the need for multihops. Our marketing should thus focus on highlighting that using multihops does not mean more fees and that having EMBER-denominated pairs provides long-term stability for liquidity providers in farms.
    "strategy": "single-choice",
    "options": [
        "Yes",
        "No"
    ],
    "snapshotBlock": "TBD",
    "endBlock": "TBD+6days+1block"
}
