{
    "title": "EMISSION ADJUSTMENT - 10.5% monthly decrease to 4% after 30 months",
    "content": "1. proposal details \n (1) adjust the current daily emission rate to 89.5% of the rate during the first month (545,300 daily emission rate), i.e. 488,043.5 for the current month \n (2) make further emission adjustments on the 21st of each month, 12 times a year, commemorating the significance of the 21m BCH and Ember hard caps \n (3) reduce emissions by relative 10.5% each month (89.5% of the previous month) for the next 30 months until we hit 4% of the rate during the first month (545,300 daily emission rate), i.e. 21,812 for the 31st month and until all 21,000,000 Ember will have beeen emitted (4) This is the expected daily emission rate table: \n MONTH	- EMISSION % - DAILY EMISSIONS \n 1 - 100.0000% - 545300.00 \n 2 - 89.5000% - 488043.50 \n 3 - 80.1025% - 436798.93 \n 4 - 71.6917% - 390935.04 \n 5 - 64.1641% - 349886.86 \n 6 - 57.4269% - 313148.74 \n 7 - 51.3971% - 280268.13 \n 8 - 46.0004% - 250839.97 \n 9 - 41.1703% - 224501.78 \n 10 - 36.8474% - 200929.09 \n 11 - 32.9785% - 179831.53 \n 12 - 29.5157% - 160949.22 \n 13 - 26.4166% - 144049.56 \n 14 - 23.6428% - 128924.35 \n 15 - 21.1603% - 115387.29 \n 16 - 18.9385% - 103271.63 \n 17 - 16.9500% - 92428.11 \n 18 - 15.1702% - 82723.16 \n 19 - 13.5773% - 74037.23 \n 20 - 12.1517% - 66263.32 \n 21 - 10.8758% - 59305.67 \n 22 - 9.7338% - 53078.57 \n 23 - 8.7118% - 47505.32 \n 24 - 7.7970% - 42517.26 \n 25 - 6.9784% - 38052.95 \n 26 - 6.2456% - 34057.39 \n 27 - 5.5898% - 30481.37 \n 28 - 5.0029% - 27280.82 \n 29 - 4.4776% - 24416.34 \n 30 - 4.0074% - 21852.62 \n 31 - 4.0000% - 21812.00 \n ... \n\n 2. economic impact - The emission shock in cutting the initial 100% daily emission rate to relative 10% (90% cut) appears to have been too abrupt as several liquidity pools (LPs) experienced liquidity exodus, thus reducing the EmberSwap DEX usage. Instead, this proposal maintains the overall 210m Ember emission after 118 months but adjusts the emission rate to make it smoother. \n\n 3. impact on users - This proposal provides smaller emission shocks over a longer period of time, thus allowing LP contributors to remain invested longer. \n\n 4. expected positive impact - With positive, predictably longer-term demand for EmberSwap DEX liqudity pools, the DEX usage is expected to increase, increasing the demand for Ember and helping to stabilize and/or positively impact the Ember:BCH exchange rate. \n\n 5. known potential negatives or downsides - With daily emission rates temporarily higher than they are now (488,043.5 vs 54,530 at the moment), there is a risk of attracting emission hunters who enter LPs simply to reap emission benefits and sell the emitted token on the open market, thus creating negative selling presure and negative impact to the Ember:BCH exchange rate. Another proposal addressing non-Ember LP pairs and basing all LPs to Ember (for non-Ember to non-Ember swaps using multi-hops) should be considered to address this particular risk. With daily emission rates eventually lower than they are now (21,812 vs 54,530 at the moment), there is a risk that the EmberSwap DEX usage will not have sufficient demand to maintain future Ember:BCH exchange rate. Another proposal addressing EmberSwap marketing within and outside of BCH should be considered to address this particular risk. \n\n 6. unknown impacts or aspects - It is not known in advance if the predictably longer-term demand for EmberSwap DEX LPs will outweight any potential emission hunters who do not care about Ember's long-term success (or worse, would like to actively undermine it, as had been experienced with the BenSwap dev dumping Ember previously to intentionally harm it).",
    "strategy": "single-choice",
    "options": [
        "Yes",
        "No"
    ],
    "snapshotBlock": "3777927",
    "endBlock": "3977927"
}
