{
    "title": "Measures to stabilize Ember and increase TLV",
    "content": "There has been a lot of discussion in the Telegram channel with ideas about how to stabilize the market price of Ember as well as increase the TLV on the DEX. There have been a great number of ideas about how to go about this, each having their own minor differences.\n\n&nbsp; \n\nI have written this proposal with several goals in mind.\n\n&nbsp; \n\nFirst is that we should implement these changes sooner rather than later.  The changes will be most effective while the daily Ember allocations are still high.\n\n&nbsp; \n\nSecond, simple is better than complex.  This is important both from the point of view of trying to explain the system to users, as well as simplifying implementation.\n\n&nbsp; \n\nThird, the system used to allocate rewards cannot be easily gamed or cheated.  We are searching for true support of this DEX, not people trying to extract as much reward as quickly as possible.\n\n&nbsp; \n\neconomic impact -\n\n&nbsp; \n\nThe goal of this proposal is to create two major economic impacts that are interrelated.\n\n&nbsp; \n\nThe first of which is to stabilize the market price of Ember.  To achieve this, we need to reduce the total number of Ember tokens that are available for market sale at any time.  To date, the vault system has been very successful in doing this.  We should continue to encourage additional Ember tokens to be locked in the vault.  I propose that we make the following changes to the vault structure.\n\n&nbsp; \n\nRemove the 7 day vault\n\nAdd a 90 day vault\n\nLeave 1 year vault allocation as it currently is.\n\nSet up 90 day vault at the same allocation as the current 30 day vault.\n\nChange 30 day vault allocation to be the same as current 7 day vault.\n\n&nbsp; \n\nThe second economic impact we are targeting is to increase the TLV of liquidity pairs on the DEX.  The stabilizing of Ember price will help to achieve this by reducing LP farming risk.  Thus LP farmers will be willing to contribute capital for lower APRs. I also propose that we establish a vault for LP tokens.  This should be a single vault that will allow locking of any LP tokens for 90 days.  This will provide an additional reward for miners who are willing to support the long term stability of the DEX.\n\n&nbsp; \n\nAdditionally, we would need to reduce the total number of farms so more reward is available for each one.  I propose that we reduce the number of farms to 10.   Initially we should select the top 10 tokens by TLV from marketcap.cash paired with Ember and allocate the rewards proportionally to their listed TLV.  After one month of operating under this model, we should re-allocate farms monthly based on the top 10 Ember paired LP tokens locked in the LP vault.  With rewards being assigned proportionally to the value of LP tokens locked.\n\n&nbsp; \n\nimpact on users -\n\nMost daily users should notice very little change to how the dex operated.  Users who are farming / staking tokens will notice that incentives have been changed to favor longer term investment.\n\n&nbsp; \n\nexpected positive impact -\n\nI believe that stabilized Ember price and new incentives will help increase TLV, which will increase trading volume, which should in turn continue to support the Ember price.\n\n&nbsp; \n\nknown potential negatives or downsides -\n\nI believe that some of the current farmers are only here for the short term gains, so in the first week or two of implementation we may see some additional instability, but after we have attracted long term investors, I think we will overcome that.\n\n&nbsp; \n\nunknown impacts or aspects  -\n\nTo my knowledge no current dexes are basing their farming allocations on locked LP.  It is unknown how the liquidity farmers will react to that.\n\n&nbsp; \n\nSummary of changes -\n\n&nbsp; \n\nChange reward allocation to -\n\n1/3 - Farming Rewards\n\n1/3 - LP Vaults\n\n1/3 - Ember Vaults\n\n&nbsp; \n\nReduce to 10 farms.  First month use marketcap.cash TLV pair with Ember, then in future months use top Ember paired LP Vault TLV\n\n&nbsp; \n\nAdd 90 day LP Vault\n\n&nbsp; \n\nRemove 7 day Ember vault and add 90 day Ember Vault\n\n&nbsp; \n\nQuestions and Discussion - I will check the Ember Swap Telegram regularly to answer questions and discuss.",
    "strategy": "single-choice",
    "options": [
        "Yes - I support long term investment",
        "No - I want to keep cashing in fast rewards"
    ],
    "snapshotBlock": "4265943",
    "endBlock": "4365943"
} 
