{
    "title": "Add lending protocol to development roadmap",
    "content": "PROPOSAL: Add lending protocol to development roadmap\n\n&nbsp; \n\n&nbsp; \n\nbchPete has recently pointed out that after aggregation, there are no additional priorities listed on the roadmap.\n\n&nbsp; \n\nI propose that we add the development of a lending protocol to the roadmap.\n\n&nbsp; \n\nECONOMIC IMPACT -\n\n&nbsp; \n\nThis should increase the value of the EMBER token and therefore EmberSwap as a whole by both creating additional use cases for the EMBER token as well as creating a sustainable source of income for the DEX.\n\n&nbsp; \n\nIMPLEMENTATION -\n\n&nbsp; \n\nI further propose that the lending protocol be developed with the following features:\n\n&nbsp; \n\nThe lending protocol should be designed with a collateralized debt position (CDP) model similar to DAI and other similar lending protocols, as this has shown long term success and stability in the DEFI market.\n\n&nbsp; \n\nInitially EMBER, FIRE, BCH, and flexUSD will be considered approved tokens for collateralization.  With further approved tokens to be specified by future governance votes.\n\n&nbsp; \n\nUsers shall be able to lock any of the approved tokens, or any of the approved tokens paired in an EmberSwap LP with the EMBER token as collateral for their loans.\n\n&nbsp; \n\nThe protocol will then allow users to borrow EMBER tokens from a lending pool up to 75% of their collateralized position.\n\n&nbsp; \n\nTo initially capitalize the lending pool, the Treasury shall supply 1 Million (or more if deemed appropriate at implementation time by governance vote) EMBER tokens.\n\n&nbsp; \n\nInitially all fees earned from operation of the lending market shall be swapped for EMBER and added to the lending pools.\n\n&nbsp; \n\nInterest rates charged for lending shall be dynamically determined by the market.  With the interest rate increasing as the percent of the lending pool on loan increases.  bchPete shall set initial interest rates per his discretion for initial implementation.  Future interest rates can be determined by governance vote.\n\n&nbsp; \n\nIMPACT ON USERS - Long term, increases in the price of the EMBER token should lead to additional DEX liquidity making EmberSwap more useful for exchanges.  The ability to loan against assets also provides users with the ability to access liquidity for other investments or expenses while maintaining exposure to the underlying collateral.\n\n&nbsp; \n\nKNOWN POTENTIAL NEGATIVES OR DOWNSIDES -\n\nThe only known downside is that upon initial deployment of lending up to 1 million additional EMBER will enter circulation.  This could lead to a short term slump in EMBER price, but that should quickly be made up for with lending income.\n\n",
    "strategy": "single-choice",
    "options": [
        "Yes - Add lending to roadmap",
        "No - I do not like lending"
    ],
    "snapshotBlock": "4733616",
    "endBlock": "4843579"
}
